#include <stdio.h>
#include <string.h>
#include <math.h>
#include "MyHeader.h"
// "MyHeader.h" 헤더파일에서 함수선언 및 함수정의
// main 함수에서는 실행하고자 하는 함수호출만 
int main()
{
	// prob1(); 
	// 1-(1) 문자열 입력받아 한 문자씩 공백으로 구분하여 출력
	// 1-(2) 문자열을 모두 대문자로 일괄 변환하여 출력

	// prob2(); 
	// 2-(1) sin, cos, tan 곡선
	// 2-(2) 원 그리기

	// prob3(); // ASCII 코드표 출력
	// prob4(); // 문자열에서 회문 판별 및 회문 최대길이 출력
	// prob5(); // 입력받은 두 수의 약수 및 최대공약수 출력
	// prob6(); // 입력받은 문자보다 알파벳 순위가 낮은 모든 문자를 출력
	// prob7(); // Swap 함수 - 두 변수의 값을 바꾸어 출력
	// prob8(); // 정수들을 입력받아 오름차순 정렬하여 출력
	 
	// prob9(); 
	// 9-(1) 홀수를 입력받아‘*’표 피라미드 출력
	// 9-(2) 입력받은 문자보다 알파벳 순위가 낮은 모든 문자를 피라미드 형태로 출력
	
	// probC(); // 음식메뉴 및 가격을 입력받아, 2가지 메뉴를 주문 시 가능한 모든 경우의 수 출력
	// probD(); // 실행 가능한 함수들의 목록 나열하여, 번호 입력 시 해당 함수를 실행

	return 0;
}